[
  {
    "type":"projects",
    "priority":"2",
    "headline":"DCIT - Data Center Information Tracking",
    "image":"/assets/images/dcitjumbotron.jpg",
    "imgAlt":"Jumbotron from DCIT application",
    "repoLink":"https://github.com/HyperSprite/dcit",
    "repoTitle":"Repo",
    "demoLink":"https://dcit.hypersprite.com/",
    "furtherReading":"https://github.com/HyperSprite/dcit/wiki",
    "repoIcon":"fa-github-square",
    "content":"This is a data center asset tracking tool that goes way beyond spreadsheets. The point was to make it easier to use the tool as the equipment is received and installed because, the reality is, nobody has time to go back and documents things.<br>I designed it using three main collections, Locations, Assets and Systems. This allows equipment to be treated as commodity while not loosing what makes each System unique. It has Search and Reporting capabilities that allow data to be easily exported and utilized by other departments. <br><br>It currently uses:<br>Node.js and Express for the server and includes such npm packages such as Passport, Moment.js and many more<br>Mongodb and Mongoose for data storage and models<br>Front end is primarily server rendered templates using Handlebars, Bootstrap and jQuery<br><br>For the future,  I hope to move to a React front end to allow for easier customization of the configuration output scripts."
  },
  {
    "type":"projects",
    "priority":"6",
    "headline":"Portfolio Project",
    "image":"/assets/images/portfolioproject.jpg",
    "imgAlt":"Header of a website",
    "repoLink":"https://github.com/HyperSprite/hypersprite.github.io",
    "repoTitle":"Repo",
    "demoLink":"http://hypersprite.github.io/",
    "repoIcon":"fa-github-square",
    "content":"This is the Portfolio Project you are looking at right now. It is library/framework free (although it does have <span class='txtlink'><a href='http://necolas.github.io/normalize.css'>Normalize.css</a></span> to get all the browsers on the same page). Make sure you click the magic wand in the lower right hand corner."
  },
  {
    "type":"opensource",
    "priority":"5",
    "headline":"GoalsManager",
    "repoLink":"https://github.com/tcote19/goalsmanager",
    "repoTitle":"Repo",
    "repoIcon":"fa-github-square",
    "image":"/assets/images/goalstar.png", "furtherReading":"https://app.moqups.com/hypersprite/neomoD50mC/view/page/ad64222d5",
    "content":"The idea is that Google has a fine Task API with a front end that has never reached its full potential. <br>I have completed some mock ups and others have begun to contribute code. This is still in early stages. <br>Some of the goals of this project are:<br/>Use as much of Google infrastructure as possible, including authentication and storage.<br/>This should be a single page app.<br/>This was just getting started but never went anywhere. Originally it was a project for a small group of Front End JavaScript developers meeting in Silicon Valley but that has since disbanded. I still think this would be an interesting project."
  },
  {
    "type":"more",
    "priority":"4",
    "headline":"World Bike Relief",
    "image":"/assets/images/wbratledville.jpg",
    "imgAlt":"Team WBR at Leadville",
    "repoLink":"http://www.worldbicyclerelief.org/",
    "repoTitle":"WBR Site",
    "furtherReading":"http://www.worldbicyclerelief.org/our-story/news/blog/876-bigger-than-mountains",
    "repoIcon":"fa-bicycle",
    "content":"World Bicycle Relief is a charity I firmly believe in that mobilizes people in Africa and other countries with Buffalo Bikes. The primary goal is to enable people to live better lives in a sustainable way. These bikes have been custom designed from the ground up for the rigors of harsh country and low environmental impact, while being sturdy enough not to become a burden on the people who need them. This enables kids to go to school, doctors to reach more people and farmers to get to market."
  },
  {
    "type":"more",
    "priority":"3",
    "headline":"Sub 9 2017 Leadville MTB Trail 100",
    "image":"/assets/images/leadvilleblvd.jpg",
    "repoLink":"http://www.leadvilleraceseries.com/mtb/leadvilletrail100mtb/",
    "repoTitle":"Race",
    "imgAlt":"Mountain biking on the Leadville Blvd.",
    "demoLink":"",
    "furtherReading":"",
    "repoIcon":"fa-square-o",
    "content":"The Leadville Trail 100 Mountain Bike Race is a bucket list item. To be an official finisher, you need to complete <em>104 miles at altitudes between ten thousand and twelve thousand five hundred feet in under twelve hours</em>. For the gold buckle, the finish time needs to be <strong>under nine hours</strong>. For a first timer, starting from the White corral (back), I've got my work cut out for me. Wish me luck! <br><br> Well... I finished with a 9:49:50. Not what I had hoped for but still a good result. Maybe next time. :)"
  },
  {
    "type":"more",
    "priority":"1",
    "headline":"HyperSprite.com Photography Blog",
    "image":"/assets/images/hyperspriteblog.jpg",
    "imgAlt":"HyperSprite Blog Image",
    "repoLink":"http://www.hypersprite.com/blog/",
    "repoTitle":"Blog",
    "demoLink":"",
    "furtherReading":"",
    "repoIcon":"fa-wordpress",
    "content":"This is a collection of pictures from my travels. Subjects range from landscapes of Yosemite and Zion National Parks to animals and other interests."
  },
  {
    "type":"opensource",
    "priority":"3",
    "headline":"Node.js - First accepted pull request ",
    "image":"/assets/images/firstpullrequest.png",
    "imgAlt":"screenshot of Github",
    "repoLink":"https://github.com/nodejs/node",
    "repoTitle":"Repo",
    "demoLink":"",
    "furtherReading":"https://github.com/nodejs/node/pull/8472",
    "repoIcon":"fa-free-code-camp",
    "content":"This isn't much, just a few simple changes but I needed wanted to start working on larger projects and looking at bigger code bases. Node.js has given me, and the javascript community,  so much I wanted to start giving back."
  },
  {
    "type":"projects",
    "priority":"7",
    "headline":"Random Quote Machine",
    "repoLink":"https://github.com/HyperSprite/hypersprite.github.io/tree/master/randomquotemachine",
    "repoTitle":"Repo",
    "image":"/assets/images/randomquotemachine.jpg",
    "demoLink":"randomquotemachine",
    "furtherReading":"https://www.freecodecamp.com/challenges/build-a-random-quote-machine",
    "repoIcon":"fa-github-square",
    "furtherReading":"http://codepen.io/HyperSprite/full/QKpEAb/",
    "moreTitle":"CodePen",
    "content":"This in part of the Intermediate Front End Developer Projects section. The task is to make a random quote display, have a button to get a new quote and a button to tweet the quote. In addition to the requirements, I also added a random background image from <span class='txtlink'><a href='http://www.unsplash.com' target='new' >Unsplash</a></span>."
  },
  {
    "type":"projects",
    "priority":"8",
    "headline":"Personal theme for HighLightjs",
    "image":"",
    "imgAlt":"",
    "repoLink":"https://github.com/HyperSprite/hypersprite.github.io/tree/master/highlightjs",
    "repoTitle":"Repo",
    "image":"/assets/images/hyperspritedarktheme.jpg",
    "demoLink":"/highlightjs/",
    "furtherReading":"",
    "repoIcon":"fa-github-square",
    "content":"In Progress: I love highlightjs and wanted to work on a theme that looks like my <span class='txtlink'><a href='/highlightjs/assets/hypersprite-dark.tmTheme' target='new' >Sublime Text theme</a></span>. Meanwhile, I switched to the Atom editor and imported my theme, that can be found in here as well."
  },
  {
    "type":"opensource",
    "priority":"1",
    "headline":"R3bl-base - Open Communication",
    "image":"/assets/images/r3blbase.jpg",
    "imgAlt":"Github Network",
    "repoLink":"https://github.com/r3bl-alliance/r3bl-base",
    "repoTitle":"Repo",
    "demoLink":"https://r3bl-base-test.herokuapp.com",
    "repoIcon":"fa-github-square",
    "content":"Working on a web platform for building all manner of useful projects. It uses technologies such as Firebase, React, Redux, Flow, Socket.io, Node, Express, Webpack and Material Design"
  },
  {
    "type":"projects",
    "priority":"1",
    "headline":"A Race athlete - A Cycling Analytics Web App",
    "image":"/assets/images/araceathlete.png",
    "imgAlt":"A Race athlete screenshot",
    "repoLink":"https://github.com/HyperSprite/redux-todo-with-auth",
    "repoIcon":"fa-github-square",
    "furtherReading":"https://www.araceathlete.com",
    "moreTitle":"Web App",
    "content":"This web app connects with Strava using Oath and features different ways to use and view athlete data.<br/><br/>Current features include:<br/><strong>Events:</strong> users can add and favorite Events. Each Event will show specific data such as starting elevation and timezone with offset based on the event location and date using Google location services. As the event grows near, it will show weather forecasting for the location on the event day, using Open Weather Maps<br/><strong>Power at Altitude:</strong> Calculates your FTP based on your training location and event altitude.<br/><strong>Weekly Stats:</strong> Calculates an athletes cumulative stats for the week.<br/><strong>Activity Search:</strong> Anyone that uses Strava knows searching their past activities is hit or miss. This uses MongoDB aggregation and text indexing to accurately return all activities that match the search. It also lets you download the activities to a CSV for further examination.<br/><br/>For the code and list of technologies and APIs, follow the <strong>Repo</strong> link. Follow the <strong>Web App</strong> link below to see this app live and scroll down the home page for more in depth feature descriptions and usage. If you're an athlete, click the <strong>\"Connect with Strava\"</strong> button in the top right to get started!"
  },
  {
    "type":"projects",
    "priority":"4",
    "headline":"Bootstrap ReduxForm Exploration",
    "image":"/assets/images/bootstrap-reduxform.jpg",
    "imgAlt":"Simple Form Image",
    "repoLink":"https://github.com/HyperSprite/bootstrap-reduxform",
    "demoLink":"https://bootstrap-reduxform.herokuapp.com",
    "repoIcon":"fa-github-square",
    "content":"This is an exploration of setting up ReduxForm for easy reuse and React styling using Bootstrap and Sass. The two main types of forms are \"Edit in place\" and \"Wizard\". Edit in place style allows the user to update their user profile without loading a whole form. The Wizard style reveals each form element as the form is filled out and displays earlier elements allowing for review before submitting. This is built using Create React App, Redux, React-Bootstrap, Redux-Form on a free Heroku dyno (so it may start up a bit slow)."
  },
  {
    "type":"projects",
    "priority":"3",
    "headline":"Material-ui Components",
    "image":"/assets/images/base-material-components.png",
    "imgAlt":"Demo AppBar with map",
    "repoLink":"https://github.com/HyperSprite/base-material-components-next",
    "demoLink":"/base-material-components",
    "repoIcon":"fa-github-square",
    "furtherReading":"/base-material-components-styleguide",
    "moreTitle":"Style Guide",
    "content":"Creating new and migrating existing components for A Race athlete. This effort will move the UI to Material-ui v1 as well as unify the styling system using JSS."
  },
  {
    "type":"projects",
    "priority":"3",
    "headline":"Image Transformation Library",
    "image":"/assets/images/img-transformation-ts.png",
    "imgAlt":"Screenshot",
    "repoLink":"https://github.com/hypersprite/img-transformer-ts",
    "repoIcon":"fa-github-square",
    "demoLink":"/img-transformation-ts",
    "furtherReading":"https://github.com/hypersprite/img-transformer-ts/tree/master/src/util",
    "moreTitle":"API Docs",
    "content":"A project to build an Image Transformation library that converts color to grayscale and rotates an image. It is built with React, Canvas, Typescript and Semantic-ui. The primary point is the API library, while the front end was built to show how it could be used."
  },
  {
    "type":"projects",
    "priority":"4",
    "headline":"NPM Just-FNS",
    "image":"/assets/images/npmjustfns.png",
    "imgAlt":"Screenshot of NPM page",
    "repoLink":"https://github.com/HyperSprite/just-fns",
    "repoTitle":"Repo",
    "furtherReading":"https://www.npmjs.com/package/just-fns",
    "moreTitle":"NPM",
    "repoIcon":"fa-github-square",
    "content":"This is a collection of functions for performing various calculations for cycling related data, as found on Strava, TrainingPeaks and TrainerRoad. I am using them in araceathlete.com (see above) and wanted to break this out into its own module for \"simplicity\". Most of these are used in the view for converting raw data into something user friendly.<br/><br/> Setup wise, the build process includes Jest, ESlint, Babel, NPM Scripts and Git commit hooks."
  }
]
